In [1]:
import pandas as pd
import numpy as np

In [4]:
#Q6
Data=pd.DataFrame({
    "Name":["A","B","C","D"],"Team":["X","X","Y","Y"],"Salary":[55000,55000,52000,53000],"Profit":[45,30,60,25]
})

In [5]:
Data

  Name Team  Salary  Profit
0    A    X   55000      45
1    B    X   55000      30
2    C    Y   52000      60
3    D    Y   53000      25

In [6]:
Profit=Data.groupby("Profit")

In [7]:
Profit

In [8]:
Profit.size()

Profit
25    1
30    1
45    1
60    1
dtype: int64

In [10]:
grouped=Data.groupby("Team")

In [11]:
Data

  Name Team  Salary  Profit
0    A    X   55000      45
1    B    X   55000      30
2    C    Y   52000      60
3    D    Y   53000      25

In [13]:
grouped

In [19]:
Average_Salary=grouped["Salary"].mean()

In [20]:
Average_Salary

Team
X    55000.0
Y    52500.0
Name: Salary, dtype: float64

In [21]:
Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Team    4 non-null      object
 2   Salary  4 non-null      int64
 3   Profit  4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 260.0+ bytes

In [24]:
total_Profit=grouped["Profit"].sum()

In [25]:
total_Profit

Team
X    75
Y    85
Name: Profit, dtype: int64

In [27]:
result=pd.DataFrame({
    "Average_Salary":Average_Salary,
    "Total_Profit":total_Profit
})
    
result

      Average_Salary  Total_Profit
Team
X            55000.0            75
Y            52500.0            85

In [29]:
#Q7
score=pd.DataFrame({
    "Name":["A","B","C","D"],"Score1":[40,55,70,30],"Score2":[50,65,75,25]
})

In [30]:
score

  Name  Score1  Score2
0    A      40      50
1    B      55      65
2    C      70      75
3    D      30      25

In [34]:
score[(score["Score1"]>40) & (score["Score2"]<50)]

Empty DataFrame
Columns: [Name, Score1, Score2]
Index: []

In [40]:
score["Average_Score"]=score[["Score1","Score2"]].mean(axis=1)

In [41]:
score

  Name  Score1  Score2  Average_Score
0    A      40      50           45.0
1    B      55      65           60.0
2    C      70      75           72.5
3    D      30      25           27.5

In [45]:
print(filter[["Name","Average_Score"]])

TypeError: type 'filter' is not subscriptable